blog/2015-05-14-jekyll-with-rails-assets.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://neiro.io/rss.xml"
      title="RSS feed for https://neiro.io/">
<title>Jekyll with Rails assets</title>
<meta name="author" content="Aleksei Kuznetsov">
    <meta name="referrer" content="no-referrer">
    <link href="https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css" rel="stylesheet" type="text/css" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico">
    <link rel="preconnect" href="https://fonts.gstatic.com">
    <link rel="canonical" href="https://neiro.io/" />
    <link rel="https://fonts.googleapis.com/css2?family=Merriweather:ital,wght@0,400;0,700;1,400&display=swap" rel="stylesheet"/></head>
<body>
<div id="preamble" class="status"><div class="header">
    <a href="https://neiro.io">Neiro | Functional programming, software architecture</a>
  </div></div>
<div id="content">
<div class="post-date">14 Mai 2015</div><h1 class="post-title"><a href="https://neiro.io/2015-05-14-jekyll-with-rails-assets.html">Jekyll with Rails assets</a></h1>
<p>
<a href="http://jekyllrb.com/">Jekyll</a> is the great static website generator,
that can be easily used for blogs, portfolio pages, galleries and others
simple projects. It`s very simple, flexible tool that can be upgraded
with hundreds powerful plugins.
</p>

<p>
If you like Ruby on Rails, you might want to use Rails assets pipeline
when you work with front-end in Jekyll. If so, here are
<a href="https://github.com/jekyll-assets/jekyll-assets">jekyll-assets</a>. This
project allows you to use some Rails-like assets pipeline functionality:
</p>

<ul class="org-ul">
<li>SASS, LESS, Coffeescript and even ERB</li>
<li><p>
Rails assets dependencies management:
</p>

<div class="org-src-container">
<pre class="src src-javascript">  <span style="color: #a5a4a5;">//</span><span style="color: #a5a4a5;">=require 'jquery'</span>
  <span style="color: #a5a4a5;">//</span><span style="color: #a5a4a5;">=require 'parallax'</span>
  <span style="color: #a5a4a5;">//</span><span style="color: #a5a4a5;">=require 'slideout'</span>
</pre>
</div></li>

<li>Minification and compression for Javascript and CSS</li>
<li>Gzipped versions of assets</li>
</ul>

<p>
But what if you also wants to use popular Bower packages with Jekyll and
jekyll-assets?<br>
First, you need <a href="https://rails-assets.org/">Rails assets</a> project,
that allows you to use any Bower modules with Bundler. You just need to
add required packages in your <i>Gemfile</i> like this:
</p>

<div class="org-src-container">
<pre class="src src-ruby">source <span style="color: #718c00;">'https://rails-assets.org'</span> <span style="color: #8959a8;">do</span>
  gem <span style="color: #718c00;">'rails-assets-jquery'</span>
  gem <span style="color: #718c00;">'rails-assets-normalize-scss'</span>
  gem <span style="color: #718c00;">'rails-assets-slideout.js'</span>
<span style="color: #8959a8;">end</span>
</pre>
</div>

<p>
It works great with Ruby on Rails, but you need some hack to use it
with jekyll-assets - by default, jekyll-assets configuration does not
include rails-assets paths. To fix this, you can load paths with
<b>Sprockets</b> in your Jekyll plugin file (<b>_plugins/ext.rb</b>) .
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #3e999f;">require</span> <span style="color: #718c00;">'jekyll-assets'</span>
<span style="color: #3e999f;">require</span> <span style="color: #718c00;">'bundler/setup'</span>

<span style="color: #eab700;">Bundler</span>.require(<span style="color: #f5871f;">:default</span>, <span style="color: #718c00;">'development'</span>)

<span style="color: #8959a8;">if</span> <span style="color: #8959a8;">defined?</span>(<span style="color: #eab700;">RailsAssets</span>)
  <span style="color: #eab700;">RailsAssets</span>.load_paths.each <span style="color: #8959a8;">do</span> |path|
    <span style="color: #eab700;">Sprockets</span>.append_path path
  <span style="color: #8959a8;">end</span>
<span style="color: #8959a8;">end</span>
</pre>
</div>

<p>
When you&rsquo;ve completed this setup, you can manage your assets almost like in
Ruby on Rails.
</p>
<div class="taglist"><a href="https://neiro.io/tags.html">Tags</a>: <a href="https://neiro.io/tag-jekyll.html">jekyll</a> <a href="https://neiro.io/tag-rails.html">rails</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
